#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Acquiring state lock. This may take a few moments...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/silver-racoon-eks/cluster]
aws_kms_key.eks: Refreshing state... [id=9a353a72-d65c-4854-a93c-37d5eff1a223]
module.vpc_cni_irsa.aws_iam_policy.vpc_cni[0]: Refreshing state... [id=arn:aws:iam::940507879621:policy/AmazonEKS_CNI_Policy-20220301220051389700000002]
module.eks.module.eks_managed_node_group["silver-racoon-1"].aws_iam_role.this[0]: Refreshing state... [id=SilverRacoonClusterReadECR]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=silver-racoon-eks-cluster-20220301220051389100000001]
module.eks.module.eks_managed_node_group["silver-racoon-1"].aws_security_group.this[0]: Refreshing state... [id=sg-065a80f400f619054]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0d8c324596a6c00d4]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-02a201b01e3c5890a]
module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"]: Refreshing state... [id=silver-racoon-eks-cluster-20220301220051389100000001-2022030122005213320000000a]
module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"]: Refreshing state... [id=silver-racoon-eks-cluster-20220301220051389100000001-20220301220052110700000009]
module.eks.module.eks_managed_node_group["silver-racoon-1"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=SilverRacoonClusterReadECR-20220301220052044800000006]
module.eks.module.eks_managed_node_group["silver-racoon-1"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=SilverRacoonClusterReadECR-20220301220052051600000007]
module.eks.module.eks_managed_node_group["silver-racoon-1"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=SilverRacoonClusterReadECR-20220301220052052100000008]
module.eks.aws_security_group_rule.node["egress_ntp_udp"]: Refreshing state... [id=sgrule-644049050]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-569382534]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3042686571]
module.eks.aws_security_group_rule.node["ingress_istio_15017"]: Refreshing state... [id=sgrule-3512412240]
module.eks.aws_security_group_rule.node["egress_ntp_tcp"]: Refreshing state... [id=sgrule-1492995479]
module.eks.aws_security_group_rule.node["ingress_lb_all"]: Refreshing state... [id=sgrule-272068495]
module.eks.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-2267246729]
module.eks.aws_security_group_rule.node["egress_cluster_443"]: Refreshing state... [id=sgrule-4037403045]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2802353330]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2390310801]
module.eks.aws_security_group_rule.node["egress_self_coredns_udp"]: Refreshing state... [id=sgrule-3754035006]
module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1369802072]
module.eks.aws_security_group_rule.node["ingress_metrics_server_4443"]: Refreshing state... [id=sgrule-2607933621]
module.eks.aws_security_group_rule.node["ingress_self_all"]: Refreshing state... [id=sgrule-1126288255]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-56043357]
module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"]: Refreshing state... [id=sgrule-3425316356]
module.eks.aws_security_group_rule.cluster["ingress_lb_all"]: Refreshing state... [id=sgrule-2941509340]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3091283752]
module.eks.aws_security_group_rule.cluster["egress_nodes_443"]: Refreshing state... [id=sgrule-1291514861]
module.eks.aws_security_group_rule.cluster["egress_nodes_ephemeral_ports_tcp"]: Refreshing state... [id=sgrule-1799211317]
module.eks.aws_security_group_rule.cluster["ingress_for_api_endpoint"]: Refreshing state... [id=sgrule-3216125723]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::940507879621:policy/silver-racoon-eks-cluster-ClusterEncryption-20220302205754245300000001]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=silver-racoon-eks-cluster-20220301220051389100000001-20220302205754704900000002]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=silver-racoon-eks]
module.eks.module.eks_managed_node_group["silver-racoon-1"].aws_launch_template.this[0]: Refreshing state... [id=lt-02d7b51bb788cedf9]
module.eks.module.eks_managed_node_group["silver-racoon-1"].aws_eks_node_group.this[0]: Refreshing state... [id=silver-racoon-eks:silver-racoon-1-2022030122162546550000000e]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::940507879621:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/44E6D66FCF0CFF1996346E03D126396F]
module.vpc_cni_irsa.aws_iam_role.this[0]: Refreshing state... [id=VPC-CNI-IRSA2022030122162498030000000d]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=silver-racoon-eks:kube-proxy]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=silver-racoon-eks:vpc-cni]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=silver-racoon-eks:coredns]
module.vpc_cni_irsa.aws_iam_role_policy_attachment.vpc_cni[0]: Refreshing state... [id=VPC-CNI-IRSA2022030122162498030000000d-20220301221625613800000010]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.eks.aws_iam_policy.cluster_encryption[0] must be replaced
-/+ resource "aws_iam_policy" "cluster_encryption" {
      ~ arn         = "arn:aws:iam::940507879621:policy/silver-racoon-eks-cluster-ClusterEncryption-20220302205754245300000001" -> (known after apply)
      ~ id          = "arn:aws:iam::940507879621:policy/silver-racoon-eks-cluster-ClusterEncryption-20220302205754245300000001" -> (known after apply)
      ~ name        = "silver-racoon-eks-cluster-ClusterEncryption-20220302205754245300000001" -> (known after apply)
      ~ name_prefix = "silver-racoon-eks-cluster-ClusterEncryption-" -> "silver-racoon-eks-cluster-ClusterEncryption" # forces replacement
      ~ policy_id   = "ANPA5V6VDLDCYDNI6J4EZ" -> (known after apply)
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      ~ id         = "silver-racoon-eks-cluster-20220301220051389100000001-20220302205754704900000002" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::940507879621:policy/silver-racoon-eks-cluster-ClusterEncryption-20220302205754245300000001" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
</details>
*Pusher: @tauxi, Action: `pull_request`*